{"Id":2,"Title":"Nenet: A Scalable Intranet Portal for the Modern Workplace","Slug":"nenet-a-scalable-intranet-portal-for-the-modern-workplace","ImageUrl":"","Content":"What I Built\nFor this challenge, I built Nenet, a holistic and dynamic intranet dashboard designed to be the central nervous system for a modern organization. My goal was to move beyond a static information portal and create an interactive ecosystem that boosts productivity, enhances communication, and fosters a strong sense of community and engagement among employees.\n\nTo bring this vision to life, I chose a modern, high-performance tech stack: Next.js, Tailwind CSS, and shadcn/ui.\n\nNext.js was the ideal framework for its powerful features like Server-Side Rendering (SSR) and file-based routing, ensuring the dashboard is fast, scalable, and provides a seamless user experience.\n\nTailwind CSS allowed me to rapidly build a custom, responsive, and visually consistent UI without writing custom CSS files. Its utility-first approach was perfect for crafting the complex, widget-based layout of Nenet.\n\nshadcn/ui provided a set of beautifully designed, accessible, and unopinionated components. This allowed me to build the UI quickly while retaining full control over styling and functionality, which was crucial for achieving Nenet\u0027s unique look and feel.\n\nNenet provides a comprehensive, at-a-glance overview of everything an employee needs, from personal tasks to company-wide performance metrics.\n\nLayout \u0026amp; Content\nSidebar Layout\nsidebar nenet\n\n1. Application Name/Logo\nAt the very top, the name \u0022Nenet.\u0022 is displayed in a large, bold font, serving as the brand identity for the platform.\n\n2. User Profile Section\nThis area personalizes the experience for the user.\n\nProfile Picture: A circular avatar user.\nUser Name: The name \u0022Mas\u0027ud Ali\u0022 is clearly displayed, identifying the user.\nUser Score/Metric: Below the name, there is a star icon next to the number \u002280.5\u0022. This performance metric within the application.\n3. Main Menu\nThis section provides the primary navigation for the application.\n\nHeader Layout\nHeader nenet\n\nOn the Left Side:\n1. Mini sidebar \u0026amp; open sidebar for mobile Toggle Icon\nThe icon on the far left, a rectangle with a line, is button to toggle mini sidebar or open sidebar for mobile\n\n2. Search Bar\nA prominent search field and placeholder text \u0022Search something...\u0022. This allows users to easily find information, documents, or other content within the application. when type in input will showing the result.\n\nOn the Right Side:\n1. Notifications\nA bell icon, which is a universal symbol for notifications. The small red dot on top indicates that the user has new, unread notifications. on click the button will show popover ui and list notification user can mark all read, clear all, and search notifications its all working.\n\n2. Launch pad\nThe nine-dot grid icon (often called a \u0022waffle menu\u0022) on click opens a popover that allows users to open new tab for selected app.\n\n3. Dark mode toggle\nUser can choose preferences between light and dark mode.\n\n4. Team Members:\nClicking opens a popover with a searchable list of members, showing their avatar, name, birthday, and social media links.\n\nAvatars: A stacked group of profile pictures representing the users or members of the current team, project, or workspace.\nMember Count: The text \u00228 members\u0022 next to the avatars explicitly states the number of people.\nIn summary, this header is from a modern, collaborative application. It provides the user with essential tools at a glance: searching, checking notifications, and seeing who is part of their team. The design is project management tools, communication platforms, or company intranets like Slack, Notion, or Microsoft Teams.\n\nMain Layout\ncontent nenet\n\n1. Welcome Section\nThis UI is dedicated to greeting the user. It features a personalized, dynamic message. This greeting is contextually aware, appropriately using \u0022Good evening\u0022 based on the current time. It also includes a brief description of the platform\u0027s purpose and The \u0022Show current tasks\u0022 button clicking will show dialog provides a direct shortcut to the user\u0027s detailed task list.\n\n2. Weekly Progress\nThis UI gives a quick, visual summary of the user\u0027s productivity. It uses a circular progress bar to show that 52% of the weekly goals have been met, further detailed as \u00223/6 tasks done\u0022. It\u0027s a motivational tool that provides immediate feedback on performance.\n\n3. News \u0026amp; Announcement Carousel\nPositioned in the top right, this large, eye-catching UI serves as the primary channel for news and announcements. It functions as a carousel, allowing multiple important items to be featured.\n\n4. Projects in Progress\nThis is a task management module that displays the user\u0027s active projects. It uses a stacked card interface, with the top card showing detailed information about task. Avatar in bottom right indicate the reporter you can hover to see detail and contact the reporter.\n\n5. Schedule\nThis component provides a clear timeline of the user\u0027s daily agenda. It lists appointments with specific times (13:00, 14:00, etc.), event titles, and the associated department or team (e.g., \u0022Marketing,\u0022 \u0022Human Resources\u0022). Avatar in bottom right indicate the reporter you can hover to see detail and contact the reporter.\n\n5. Quick Links\nThis section provides single-click access to the most important areas of the intranet. It features five clearly labeled buttons: News, Spaces, People, Social Corner, and Handbook. This serves as a secondary, more visual navigation menu.\n\n6. Spaces\n\u0022Spaces\u0022 are collaborative hubs or communities within the platform. This widget showcases several key spaces like Company Announcement, Human Resources, Information Technology, and the Paris Office. Each space is presented as a card with an icon and description, and a \u0022View more\u0022 link allows users to browse all available spaces.\n\n7. Stats\nThis widget provides high-level business intelligence with clear data visualizations. It includes two charts:\n\nProject completed: A bar chart showing the trend of completed projects\nNew hires: A similar bar chart tracking new employee onboarding over the same period, This offers a transparent view of company growth and productivity.\n8. Event\nThis is a comprehensive module for managing and viewing company events.\nThe main feature is a tabbed interface allowing users to filter events by Ongoing, Upcoming, and Finished status.\n\n9. Your Performance\nThis UI provides the user with a private, detailed view of their own work patterns.\n\nChart Type: It uses a dual-line graph to compare performance over time.\nMetrics: The Y-axis measures performance in hours (from 0h to 12h), likely representing hours worked or time logged on tasks. The X-axis tracks the days of the month.\nComparison: The two lines allow for easy comparison between \u0022This month\u0022 (dark line) and \u0022Last month\u0022 (green line), helping the user identify trends and changes in their daily productivity.\n10. Top Performers\nThis fully-visible is the public-facing side of performance tracking and serves as a powerful tool for gamification and recognition.\n\nFiltering: It features tabs to filter the leaderboard by different time frames: All Time, Last 30 Days, This Week, and Today..\nLeaderboard: It ranks employees based on a performance score. Each entry includes: The employee\u0027s name, photo, and job title\nTheir total Score The positive or negative Change in their score over the selected period.\nPurpose: This feature fosters motivation and friendly competition by publicly celebrating high achievers. It directly connects to the personal score seen in the user\u0027s sidebar profile.\n\nOverall Dashboard Summary\nthe Nenet dashboard proves to be a comprehensive and well-designed hub for the modern workplace. It masterfully balances:\n\nPersonal Productivity (Welcome message, My Tasks, Your Performance chart).\nTeam \u0026amp; Company Collaboration (Spaces, Schedule, Events).\nInformation \u0026amp; News (Announcements, News links).\nPerformance \u0026amp; Engagement (Stats, Weekly Progress, Top Performers leaderboard).\nThe consistent design and thoughtful integration of these elements create a single, powerful tool that supports an user throughout their day.\n\nResponsiveness\nNenet responsive\nResponsive design is the practice of building a web that automatically adapts its layout to fit the user\u0027s screen size, providing an optimal experience on any device. This image showcases that principle beautifully:\n\nDesktop and Laptop: On wide screens, the \u0022Nenet\u0022 dashboard uses a multi-column layout to display many widgets side-by-side, making full use of the available space.\nTablet: On the mid-sized tablet screen, the layout intelligently collapses into a single, scrollable column. The content remains large, readable, and easy to interact with via touch.\nSmartphone: On the smallest screen, the layout becomes even more compact and linear. Font sizes, buttons, and spacing are all adjusted to ensure usability on a narrow display.\nDesktop Performance: Exceptional Quality\nspeed desktop\nFor this i using google page speed insights. in This report shows a near-perfect score for the desktop version of your application. The scores of 99 in Performance and a perfect 100 in Accessibility, Best Practices, and SEO. They prove that the application is extremely fast, fully accessible, and built to the highest professional standards for desktop users.\n\nMobile Performance: Strong and Responsive\nspeed mobile\nFor this i using google page speed insights. he mobile report also demonstrates excellent quality. A Performance score of 87 is very strong for mobile\u0027s stricter testing conditions, indicating a fast and responsive user experience. The perfect 100 in Accessibility, Best Practices, and SEO confirm that the application is perfectly optimized for users on any device, showcasing a high-quality, mobile-first approach.\n\nDemo\nLive Demo URL: link\nSource code : link\n\nJourney\nMy journey began when I discovered the challenge. I started by researching what an intranet workspace typically looks like. Later, Axero provided some template examples, which gave me a clearer direction and inspiration for the project.\n\nProcess\nThe process began with choosing the tech stack. I decided to use Next.js, as it offers scalability and is well-maintained. Alongside it, I used Tailwind CSS and shadcn/ui for styling and UI components.\n\nI then searched online for UI inspiration and found several designs that worked well together, which helped me shape the overall look and feel. For the content, I referred to Axero’s intranet templates.\n\nAfter building the core of the project, I reviewed the judging criteria and saw that Accessibility was important. I focused on improving accessibility, optimizing performance, and refining my code.\n\nFinally, I worked on making the design responsive across various devices. I used the ResponsivelyApp to test and adjust the UI for different screen sizes. With everything polished, the project was complete.\n\nWhat I\u0027m Proud Of\nThe Polished UI/UX: I invested a lot of time, refining the user interface. I believe the final result is not just functional but also aesthetically pleasing and a joy to use.\n\nThe Performance Scores: Seeing scores of 99 on Desktop and a strong 87 on Mobile was incredibly rewarding. It\u0027s objective proof that the architectural and technology choices paid off, resulting in a high-quality, professional-grade application.\n\nThe Engagement System: I didn\u0027t want to build just another information portal. The interconnected system of personal performance charts, weekly progress trackers, and the public \u0022Top Performers\u0022 leaderboard was my attempt at creating a truly engaging platform that motivates and recognizes employees.\n\nTeam Submission\nI worked on this challenge individually.\n\nLICENSE : MIT\n\nI want to extend a huge thank you to Axero and the DEV Community for organizing this challenge. The \u0022Office Edition\u0022 theme provided the perfect motivation and a clear, real-world problem to solve. Having a deadline and a community of fellow developers to share with was the catalyst I needed to push this project from a simple idea to a fully-realized, high-performance application. It was a fantastic experience!","CreatedDate":"2025-07-27T00:00:00"}